const facts = [
  "Українська мова має понад 250 000 слів.",
  "У 1934 році в Парижі українська мова посіла 2 місце за мелодійністю.",
  "Слово «любов» має понад 10 синонімів.",
  "Українська має найбільшу кількість зменшувально-пестливих слів.",
  "Українська мова входить у топ-3 наймелодійніших мов світу.",
  "Українська мова — одна з найстаріших слов'янських мов.",
  "Більшість українських слів мають давньоруське походження.",
  "Українська мова багата на фразеологізми та прислів’я.",
  "Слово «свобода» в українських піснях зустрічається сотні разів."
];

let lastFactIndex = -1;

function showFact() {
  let index;
  do {
    index = Math.floor(Math.random() * facts.length);
  } while (index === lastFactIndex);
  
  lastFactIndex = index;
  document.getElementById("fact").innerText = facts[index];
}
